#+TITLE: August 7, 2017 - August 22, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                            | CANCELED |
|------+------+-------------+---------+-----------------------------------------------------------------+----------|
|      |      |             |         | WRITING.1502388372. Joining files together (2017-08-22)         |          |
|      |      |             |         | WRITING.1502388337. Implementing locally sensitive (2017-08-22) |          |
|      |      |             |         | READING.1502388306. Locally sensitive hashing (2017-08-14)      |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME          | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|---------------+-----------+--------+------+-----------+--------------+------------|
| Jasonbraganza |         0 |      0 |    0 |         0 |   2017-09-13 | ---------- |
| Ikshitji      |         0 |      0 |    0 |         0 |   2017-09-13 | ---------- |
| Amey          |      12.0 |  25.83 | 12.0 |         0 |   2017-09-13 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  12 ++--#############################--+--------+--------+-------+-------++   
:     |   ....                         ##                                   |   
:     |       .                                              ACTUAL ####### |   
:  10 ++       .........                 #####################IDEAL######..++   
:     |                 ...                                             #   |   
:     |                    .                                             #  |   
:   8 ++                    .........                                    # ++   
:     |                              ...                                 #  |   
:     |                                 .                                #  |   
:   6 ++                                 ....                             #++   
:     |                                      ....                         # |   
:     |                                          .                        # |   
:   4 ++                                          .........               #++   
:     |                                                    ...             #|   
:     |                                                       .            #|   
:   2 ++                                                       .........   #+   
:     |                                                                 ...#|   
:     |                                                                    .*   
:   0 ++-------+--------+-------+--------+--------+--------+-------+-------+*   
:     0        2        4       6        8        10       12      14       16  
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:16]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                       |
|-----+------------+--------+-------+---------------------------------------|
|   1 | 2017-08-07 |   12.0 |    11 |                                       |
|   2 | 2017-08-08 |   12.0 |    10 |                                       |
|   3 | 2017-08-09 |   12.0 |    10 |                                       |
|   4 | 2017-08-10 |   12.0 |     9 |                                       |
|   5 | 2017-08-11 |   12.0 |     8 |                                       |
|   6 | 2017-08-12 |   12.0 |     8 |                                       |
|   7 | 2017-08-13 |   12.0 |     7 |                                       |
|   8 | 2017-08-14 |   10.0 |     6 | READING.1502388306                    |
|   9 | 2017-08-15 |   10.0 |     5 |                                       |
|  10 | 2017-08-16 |   10.0 |     4 |                                       |
|  11 | 2017-08-17 |   10.0 |     4 |                                       |
|  12 | 2017-08-18 |   10.0 |     3 |                                       |
|  13 | 2017-08-19 |   10.0 |     2 |                                       |
|  14 | 2017-08-20 |   10.0 |     2 |                                       |
|  15 | 2017-08-21 |   10.0 |     1 |                                       |
|  16 | 2017-08-22 |    0.0 |     0 | WRITING.1502388337 WRITING.1502388372 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                   | TASKID             | OWNER | PRIORITY | TODO | ESTIMATED | ACTUAL |
|----------------------------------------+--------------------+-------+----------+------+-----------+--------|
| TASKS                                  |                    |       | B        |      |      12.0 |  25.83 |
|----------------------------------------+--------------------+-------+----------+------+-----------+--------|
| Locally sensitive hashing              | READING.1502388306 | amey  | B        | DONE |       2.0 |    6.0 |
|----------------------------------------+--------------------+-------+----------+------+-----------+--------|
| Joining files together                 | WRITING.1502388372 | amey  | B        | DONE |       6.0 |    5.6 |
|----------------------------------------+--------------------+-------+----------+------+-----------+--------|
| Implementing locally sensitive hashing | WRITING.1502388337 | amey  | B        | DONE |       4.0 |  14.23 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2017-08-07 Mon>
  :wpd-amey:      2.5
  :wpd-ikshitji:  1.0
  :wpd-jasonbraganza: 1.0
  :END:
** DONE Locally sensitive hashing
    CLOSED: [2017-08-14 Mon 13:05]
    :PROPERTIES:
    :ESTIMATED: 2.0
    :ACTUAL: 6.0
    :OWNER: amey
    :ID: READING.1502388306
    :TASKID: READING.1502388306
    :END:
    :LOGBOOK:
    CLOCK: [2017-08-12 Sat 19:23]--[2017-08-12 Sat 20:00] =>  0:37
    CLOCK: [2017-08-12 Sat 15:04]--[2017-08-12 Sat 15:54] =>  0:50
    CLOCK: [2017-08-12 Sat 11:16]--[2017-08-12 Sat 12:10] =>  0:54
    CLOCK: [2017-08-11 Fri 10:10]--[2017-08-11 Fri 11:05] =>  0:55
    CLOCK: [2017-08-11 Fri 20:02]--[2017-08-11 Fri 20:55] =>  0:53
    CLOCK: [2017-08-10 Thu 10:55]--[2017-08-10 Thu 11:15] =>  0:20
    CLOCK: [2017-08-09 Wed 08:50]--[2017-08-09 Wed 09:30] =>  0:40
    CLOCK: [2017-08-08 Tue 11:35]--[2017-08-08 Tue 12:26] =>  0:51
    :END:
** DONE Joining files together
   CLOSED: [2017-08-22 Tue 22:15]
   :PROPERTIES:
    :ESTIMATED: 6.0
    :ACTUAL: 5.6
    :OWNER: amey
    :ID: WRITING.1502388372
    :TASKID: WRITING.1502388372
    :END:
    :LOGBOOK:
    CLOCK: [2017-08-18 Fri 19:35]--[2017-08-18 Fri 20:30] =>  0:55
    CLOCK: [2017-08-18 Fri 17:31]--[2017-08-18 Fri 18:34] =>  1:03
    CLOCK: [2017-08-18 Fri 13:54]--[2017-08-18 Fri 15:16] =>  1:22
    CLOCK: [2017-08-18 Fri 12:09]--[2017-08-18 Fri 12:23] =>  0:14
    CLOCK: [2017-08-18 Fri 11:01]--[2017-08-18 Fri 11:41] =>  0:40
    CLOCK: [2017-08-18 Fri 09:13]--[2017-08-18 Fri 09:50] =>  0:37
    CLOCK: [2017-08-17 Thu 08:00]--[2017-08-17 Thu 08:45] =>  0:45
    :END:
** DONE Implementing locally sensitive hashing
    CLOSED: [2017-08-22 Tue 22:00]
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL: 14.23
    :OWNER: amey
    :ID: WRITING.1502388337
    :TASKID: WRITING.1502388337
    :END:
    :LOGBOOK:
    CLOCK: [2017-08-16 Wed 22:45]--[2017-08-17 Thu 00:20] =>  1:35
    CLOCK: [2017-08-16 Wed 21:15]--[2017-08-16 Wed 22:05] =>  0:50
    CLOCK: [2017-08-16 Wed 19:00]--[2017-08-16 Wed 20:15] =>  1:15
    CLOCK: [2017-08-16 Wed 08:16]--[2017-08-16 Wed 08:55] =>  0:39
    CLOCK: [2017-08-15 Tue 20:18]--[2017-08-15 Tue 20:51] =>  0:33
    CLOCK: [2017-08-15 Tue 18:37]--[2017-08-15 Tue 18:57] =>  0:20
    CLOCK: [2017-08-15 Tue 16:34]--[2017-08-15 Tue 17:51] =>  1:17
    CLOCK: [2017-08-15 Tue 15:05]--[2017-08-15 Tue 15:34] =>  0:29
    CLOCK: [2017-08-15 Tue 13:27]--[2017-08-15 Tue 14:02] =>  0:35
    CLOCK: [2017-08-15 Tue 11:21]--[2017-08-15 Tue 12:30] =>  1:09
    CLOCK: [2017-08-14 Mon 21:15]--[2017-08-14 Mon 21:31] =>  0:16
    CLOCK: [2017-08-14 Mon 20:12]--[2017-08-14 Mon 20:55] =>  0:43
    CLOCK: [2017-08-14 Mon 16:28]--[2017-08-14 Mon 17:06] =>  0:38
    CLOCK: [2017-08-14 Mon 15:20]--[2017-08-14 Mon 16:08] =>  0:48
    CLOCK: [2017-08-14 Mon 11:34]--[2017-08-14 Mon 12:33] =>  0:59
    CLOCK: [2017-08-13 Sun 14:00]--[2017-08-13 Sun 15:17] =>  1:17
    CLOCK: [2017-08-13 Sun 13:31]--[2017-08-13 Sun 13:47] =>  0:16
    CLOCK: [2017-08-13 Sun 11:52]--[2017-08-13 Sun 12:27] =>  0:35
    :END:
